<a href="https://colab.research.google.com/github/harsha8745/IBM-WATSON/blob/master/Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Finding the top 3 paid employees from each department

## Method 1 : Using Pandas

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df_dept = pd.read_csv("Departments1.csv")

In [ ]:
df_dept.head()

   DEP_ID     DEP_NAME
0       1  Engineering
1       2     Software
2       3           HR

In [ ]:
df_dept.dtypes

DEP_ID       int64
DEP_NAME    object
dtype: object

In [ ]:
df_emp = pd.read_csv("Employees1.csv")

In [ ]:
df_emp.head()

  EMP_ID EMP_NAME  DEP_ID
0  E1001     John       3
1  E1002    Alice       3
2  E1003    Steve       1
3  E1004  Santosh       2
4  E1005    Ahmed       1

In [ ]:
df_emp.dtypes

EMP_ID      object
EMP_NAME    object
DEP_ID       int64
dtype: object

In [ ]:
df_sal = pd.read_csv("Salaries1.csv")

In [ ]:
df_sal.head()

  EMP_ID  SALARY
0  E1001   83000
1  E1002   59000
2  E1003   88000
3  E1004   86000
4  E1005   56000

In [ ]:
df_sal.dtypes

EMP_ID    object
SALARY     int64
dtype: object

In [ ]:
#merging the dataframes
df_merge1 = df_emp.join(df_sal.set_index("EMP_ID"),on="EMP_ID")
df_merge1.head()

  EMP_ID EMP_NAME  DEP_ID  SALARY
0  E1001     John       3   83000
1  E1002    Alice       3   59000
2  E1003    Steve       1   88000
3  E1004  Santosh       2   86000
4  E1005    Ahmed       1   56000

In [ ]:
df_merge2 = df_merge1.join(df_dept.set_index("DEP_ID"),on="DEP_ID")
df_merge2.head()

  EMP_ID EMP_NAME  DEP_ID  SALARY     DEP_NAME
0  E1001     John       3   83000           HR
1  E1002    Alice       3   59000           HR
2  E1003    Steve       1   88000  Engineering
3  E1004  Santosh       2   86000     Software
4  E1005    Ahmed       1   56000  Engineering

In [ ]:
df = df_merge2.drop(["EMP_ID","DEP_ID"],axis=1)
df.head()

  EMP_NAME  SALARY     DEP_NAME
0     John   83000           HR
1    Alice   59000           HR
2    Steve   88000  Engineering
3  Santosh   86000     Software
4    Ahmed   56000  Engineering

In [ ]:
list(df.DEP_NAME.unique())

['HR', 'Engineering', 'Software']

In [ ]:
df_results = pd.DataFrame({"EMP_NAME":[], "SALARY":[],	"DEP_NAME":[]})
for i in list(df.DEP_NAME.unique()):
  df1 = df[df["DEP_NAME"]==i]
  df2 = df1.sort_values("SALARY",ascending=False).head(3)
  df_results = df_results.append(df2,ignore_index=True)

df_results

    EMP_NAME   SALARY     DEP_NAME
0     Oliver  88000.0           HR
1  Alexander  86000.0           HR
2       John  83000.0           HR
3      Ethan  97000.0  Engineering
4      Lucas  95000.0  Engineering
5      Steve  88000.0  Engineering
6      Nancy  99000.0     Software
7       Jack  98000.0     Software
8   Benjamin  87000.0     Software

##Method 2: Using SQL(IBM DB2 on cloud) for quering the data

In [ ]:
#loading SQL extension
%load_ext sql

In [ ]:
!pip install -q ibm_db
import ibm_db
!pip install -q ibm_db_sa
import ibm_db_sa
!pip install -q sqlalchemy
import sqlalchemy
from sqlalchemy import *

In [ ]:
#connecting to my database service instance
%sql ibm_db_sa://bjc15249:***@dashdb-txn-sbox-yp-lon02-06.services.eu-gb.bluemix.net:50000/BLUDB

DB2/LINUXX8664

'Connected: bjc15249@BLUDB'

In [ ]:
results = %sql select E.EMP_ID, E.EMP_NAME, E.DEP_ID, S.SALARY , D.DEP_NAME from EMPLOYEES1 E inner join  SALARIES1 S on E.EMP_ID = S.EMP_ID inner join  DEPARTMENTS1 D on E.DEP_ID = D.DEP_ID;
results

 * ibm_db_sa://bjc15249:***@dashdb-txn-sbox-yp-lon02-06.services.eu-gb.bluemix.net:50000/BLUDB
Done.

[('E1001', 'John', 3, 83000, 'HR'),
 ('E1002', 'Alice', 3, 59000, 'HR'),
 ('E1003', 'Steve', 1, 88000, 'Engineering'),
 ('E1004', 'Santosh', 2, 86000, 'Software'),
 ('E1005', 'Ahmed', 1, 56000, 'Engineering'),
 ('E1006', 'Nancy', 2, 99000, 'Software'),
 ('E1007', 'Mary', 2, 50000, 'Software'),
 ('E1008', 'Bharath', 1, 54000, 'Engineering'),
 ('E1009', 'Andrea', 3, 62000, 'HR'),
 ('E1010', 'Ann', 1, 56000, 'Engineering'),
 ('E1011', 'Liam', 1, 81000, 'Engineering'),
 ('E1012', 'Noah', 3, 62000, 'HR'),
 ('E1013', 'Oliver', 3, 88000, 'HR'),
 ('E1014', 'William', 3, 52000, 'HR'),
 ('E1015', 'Elijah', 2, 65000, 'Software'),
 ('E1016', 'James', 3, 61000, 'HR'),
 ('E1017', 'Benjamin', 2, 87000, 'Software'),
 ('E1018', 'Lucas', 1, 95000, 'Engineering'),
 ('E1019', 'Mason', 2, 77000, 'Software'),
 ('E1020', 'Ethan', 1, 97000, 'Engineering'),
 ('E1021', 'Alexander', 3, 86000, 'HR'),
 ('E1022', 'Henry', 3, 68000, 'HR'),
 ('E1023', 'Jacob', 1, 71000, 'Engineering'),
 ('E1024', 'Michael', 2, 53000, 'Software'),
 ('E1025', 'Daniel', 1, 74000, 'Engineering'),
 ('E1026', 'Logan', 1, 63000, 'Engineering'),
 ('E1027', 'Jackson', 1, 86000, 'Engineering'),
 ('E1028', 'Sebastian', 3, 79000, 'HR'),
 ('E1029', 'Jack', 2, 98000, 'Software'),
 ('E1030', 'Aiden', 1, 85000, 'Engineering')]

In [ ]:
#converting into dataframe
df = results.DataFrame()
df.head()

  emp_id emp_name  dep_id  salary     dep_name
0  E1001     John       3   83000           HR
1  E1002    Alice       3   59000           HR
2  E1003    Steve       1   88000  Engineering
3  E1004  Santosh       2   86000     Software
4  E1005    Ahmed       1   56000  Engineering

In [ ]:
df = df.drop(["emp_id","dep_id"],axis=1)
df.head()

  emp_name  salary     dep_name
0     John   83000           HR
1    Alice   59000           HR
2    Steve   88000  Engineering
3  Santosh   86000     Software
4    Ahmed   56000  Engineering

In [ ]:
list(df.dep_name.unique())

['HR', 'Engineering', 'Software']

In [ ]:
df_results = pd.DataFrame({"emp_name":[], "salary":[],	"dep_name":[]})
for i in list(df.dep_name.unique()):
  df1 = df[df["dep_name"]==i]
  df2 = df1.sort_values("salary",ascending=False).head(3)
  df_results = df_results.append(df2,ignore_index=True)

df_results

    emp_name   salary     dep_name
0     Oliver  88000.0           HR
1  Alexander  86000.0           HR
2       John  83000.0           HR
3      Ethan  97000.0  Engineering
4      Lucas  95000.0  Engineering
5      Steve  88000.0  Engineering
6      Nancy  99000.0     Software
7       Jack  98000.0     Software
8   Benjamin  87000.0     Software